{
  "name": "Kevin Zhu",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Kevin Zhu",
  "headerTaglineThree": "Full-Stack Developer,",
  "headerTaglineFour": "Musician, and Foodie",
  "profileSrc": "https://i.ibb.co/zHBQSzH/Kevin-Copenhagen.jpg",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "GitHub",
      "link": "https://github.com/Kevinland123"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/zhukevin2001/"
    },
    {
      "id": "3",
      "title": "Email",
      "link": "mailto:zhukevin2001@gmail.com"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "Personal Website",
      "description": "Crafted a dynamic and visually appealing personal website to not only showcase my evolving web development skills but also serve as a hub for presenting diverse projects. This endeavor enabled me to delve into the intricacies of web hosting and leverage the efficiency of Tailwind CSS for streamlined styling and responsiveness.",
      "imageSrc": "https://i.ibb.co/8Ps18Cd/Website.jpg",
      "url": "https://github.com/Kevinland123/PersonalWebsite"
    },
    {
      "id": "2",
      "title": "PuzzlePals",
      "description": "Contributed significantly to both the front-end and computer vision aspects. On the front-end, I spearheaded the implementation of camera interactions and engaging pop-ups. Simultaneously, in the computer vision domain, I played a pivotal role in enhancing image aesthetics through background removal. This experience showcased my versatility and ability to seamlessly integrate across diverse project facets.",
      "imageSrc": "https://user-images.githubusercontent.com/97307947/232864692-1ce990a9-bb69-4d86-ac3c-eec5f488a466.png",
      "url": "https://github.com/stef405/make-skis"
    },
    {
      "id": "3",
      "title": "PersonaGram",
      "description": "Innovated and orchestrated the development of PersonaGram, a bespoke mystery gift box platform that curated personalized experiences for customers. Led the end-to-end development of the platform utilizing Flask, seamlessly integrating the Stripe API for secure and efficient payment processing. The implementation included the orchestration of a robust Postgres database hosted on AWS, ensuring optimal functionality and secure data storage. It has been discontinued as of December 2021.",
      "imageSrc": "https://i.ibb.co/jWYSnH1/Persona-Gram.jpg",
      "url": "https://github.com/Kevinland123/PersonaGram"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Art Direction",
      "description": "We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."
    },
    {
      "id": "2",
      "title": "Branding",
      "description": "We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."
    },
    {
      "id": "3",
      "title": "Web Design",
      "description": "We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."
    },
    {
      "id": "4",
      "title": "3D Design",
      "description": "We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."
    }
  ],
  "resume": {
    "tagline": "👋  I'm a full-stack web developer who loves creating innovative product.",
    "description": "With a strong background in full-stack development including my past internships and contributions to open-source projects in React and Python, I am ready to tackle challenging projects and make a global imapct.",
    "experiences": [
      {
        "id": "1",
        "dates": "May 2022 - Aug 2022",
        "location": "Detroit, MI",
        "company": "Amazon Inc.",
        "position": "Software Development Engineer Intern",
        "bullets": [
          "Designed and implemented 3 web pages to demonstrate team products through examples and referenced by 800+ internal project teams. Technologies include React J.S., TypeScript, and AWS tools such as CloudFormation, Lambda, and Route53",
          "Utilized Amazon frameworks to build automating web development tools that has 200+ usages from internal teams annually",
          "Deployed 2 metrics chart to embed into weekly on-call's CloudWatch alarm evaluation system",
          "Piloted demo page design with other experienced UX designers by prototyping in Figma and leading 2 design meetings",
          "Crafted unit tests, regression tests, and visual test cases with Jest, Selenium, and Cypress"
        ]
      },
      {
        "id": "2",
        "dates": "May 2021 - Nov 2021",
        "location": "San Francisco, CA | Remote",
        "company": "Alariss Global",
        "position": "Software Development Intern",
        "bullets": [
          "Developed product roadmaps for Alariss, utilizing Trello and Figma, to advance the mission of connecting U.S. talents with tech companies expanding from emerging markets",
          "Piloted technical product briefs, codebase, and REST API in Flask, Docker, and PostgREST for the Interview Scheduler – an interactive web app deployed on Heroku, automating a low-friction process and negates ~28 hours of operation per deal",
          "Coordinated and implemented the candidate onboarding flow, matching algorithm, and a fintech integration interstitial payment page connected to the Stripe API using React, Typescript, and Python for the Alariss Job Portal"
        ]
      },
      {
        "id": "3",
        "dates": "Jan 2023 - Present",
        "location": "Ann Arbor, MI | Remote",
        "company": "ZeroWaste.Org",
        "position": "Web Developer (Part Time)",
        "bullets": [
          "Improved reachability of the web application by implementing SEO techniques and Google Analytics"
        ]
      }
    ],
    "education": {
      "universityName": "University of Michigan Ann Arbor",
      "universityDate": "May 2023",
      "universityDegree": "B.S. in Computer Science, minor in Entrepreneurship and Music",
      "universityPara": "Relevant Coursework: Web Design, Computer Vision, Machine Learning, Database Management, and Data Structures"
    },
    "languages": [
      "Javascript",
      "HTML",
      "CSS",
      "Python",
      "Kotlin",
      "SQL"
    ],
    "frameworks": [
      "React",
      "Typescript",
      "NodeJs",
      "jQuery"
    ],
    "others": [
      "Chinese",
      "Figma",
      "Docker",
      "AWS"
    ]
  }
}